In [1]:
from sqlalchemy import create_engine

#engine = create_engine('postgres:blah blah blah this is secret')

In [3]:
import pandas as pd

In [4]:
sql = """
SELECT name, calories
FROM foods
WHERE name LIKE '%%Whop%%'
ORDER BY calories DESC
;
"""

In [84]:
df = pd.read_sql_query(sql, engine)
df.head()

,id,Foods,Restaurant,Category,carbs,calories,fat
0,199,Chocolate Chip Cookie Sundae,Applebee's,Desserts,210,154,74
1,897,Whopper JR.® Sandwich with Cheese w/o Mayo,Burger King,Sandwiches,660,300,14
2,1692,Chili – Bowl,Dairy Queen,Soups,881,710,24
3,2741,Herbal Tea,IHOP,Drinks,2,0,0

In [75]:
sql = """
SELECT name, calories, carbs, (calories/7) as "One Bite", calories/2 as "Half Sandwich"
FROM foods
WHERE name LIKE '%%Whop%%'
ORDER BY calories DESC
;
"""
df = pd.read_sql_query(sql, engine)
df.head()

In [83]:
sql = """
SELECT foods.id, foods.name as "Foods", restaurants.name as "Restaurant", categories.name as "Category", foods.carbs, foods.calories, foods.fat
FROM foods
INNER JOIN restaurants ON restaurants.id = foods.restaurant_id
INNER JOIN categories ON categories.id = foods.category_id
WHERE carbs > calories
;
"""

df = pd.read_sql_query(sql, engine)
df

,id,Foods,Restaurant,Category,carbs,calories,fat
0,199,Chocolate Chip Cookie Sundae,Applebee's,Desserts,210,154,74
1,897,Whopper JR.® Sandwich with Cheese w/o Mayo,Burger King,Sandwiches,660,300,14
2,1692,Chili – Bowl,Dairy Queen,Soups,881,710,24
3,2741,Herbal Tea,IHOP,Drinks,2,0,0

In [82]:
sql = """
SELECT foods.id, foods.name as "Foods", restaurants.name as "Restaurant", categories.name as "Category", foods.carbs, foods.calories, foods.fat
FROM foods
INNER JOIN restaurants ON restaurants.id = foods.restaurant_id
INNER JOIN categories ON categories.id = foods.category_id
WHERE restaurants.name = 'Burger King' OR restaurants.name = 'Dairy Queen'
AND categories.name = 'Drinks'
ORDER BY calories DESC
;
"""

df = pd.read_sql_query(sql, engine)
df.head()

,id,Foods,Restaurant,Category,carbs,calories,fat
0,777,BK™ Ultimate Breakfast Platter,Burger King,Breakfast,134,1310,72
1,883,Texas Triple Whopper® Sandwich,Burger King,Sandwiches,50,1270,86
2,887,Triple Whopper® Sandwich With Cheese,Burger King,Sandwiches,53,1230,82
3,885,Triple Whopper® Sandwich,Burger King,Sandwiches,51,1140,75
4,888,Triple Whopper® Sandwich With Cheese w/o Mayo,Burger King,Sandwiches,53,1070,64

In [81]:
sql = """
SELECT categories.name, AVG(foods.calories) as AvgCal, AVG(foods.carbs) as AvgCarbs, AVG(foods.fat) as AvgFat
FROM categories
INNER JOIN foods ON foods.category_id=categories.id
GROUP BY categories.name
ORDER BY categories.name
;
"""

df = pd.read_sql_query(sql, engine)
df.head()

                   name      avgcal   avgcarbs     avgfat
0            Appetizers  807.920000  62.850000  47.315000
1                Breads  464.716981  85.415094   6.301887
2             Breakfast  554.472637  50.997468  31.388060
3  Breakfast Sandwiches  389.846154  68.084746  43.215385
4       Breakfast Tacos  492.571429  38.470588  25.904762

In [80]:
sql = """
SELECT COUNT(categories.name) as total_count, categories.name, AVG(foods.calories) as AvgCal, AVG(foods.carbs) as AvgCarbs, AVG(foods.fat) as AvgFat
FROM categories
INNER JOIN foods ON foods.category_id=categories.id
GROUP BY categories.name
ORDER BY total_count DESC
;
"""

df = pd.read_sql_query(sql, engine)
df.head()

   total_count        name      avgcal   avgcarbs     avgfat
0          534       Sides  243.734082  27.942748  11.801498
1          524     Entrees  724.778626  53.019120  37.660305
2          488  Sandwiches  608.883197  55.796680  28.795082
3          402   Breakfast  554.472637  50.997468  31.388060
4          389    Desserts  480.691517  66.012953  22.408740

In [79]:
sql = """
SELECT restaurants.name, MAX(foods.fat) as AvgFat
FROM restaurants
INNER JOIN foods ON foods.restaurant_id=restaurants.id
GROUP BY restaurants.name
ORDER BY AvgFat DESC
;
"""

df = pd.read_sql_query(sql, engine)
df.head()

                                    name  avgfat
0  Bojangle's Famous Chicken 'n Biscuits     540
1                     Corner Bakery Cafe     490
2                       Joe's Crab Shack     168
3                             Applebee's     162
4                     Buffalo Wild Wings     158